In [2]:
import numpy as np
import pandas as pd

In [3]:
dict1 = { "name":['silki','gitesh','santoshi','soham'],
         "marks":[96,95,85,80],
         "city":['rampur','manipur','nagpur','pune']
    
}

In [4]:
df = pd.DataFrame(dict1)

In [5]:
dict1

{'name': ['silki', 'gitesh', 'santoshi', 'soham'],
 'marks': [96, 95, 85, 80],
 'city': ['rampur', 'manipur', 'nagpur', 'pune']}

In [6]:
df

       name  marks     city
0     silki     96   rampur
1    gitesh     95  manipur
2  santoshi     85   nagpur
3     soham     80     pune

In [7]:
df.to_csv('friend.csv')

In [8]:
df.to_csv('friend_index_false.csv',index=False)

In [9]:
df

       name  marks     city
0     silki     96   rampur
1    gitesh     95  manipur
2  santoshi     85   nagpur
3     soham     80     pune

In [10]:
df.head(2)

     name  marks     city
0   silki     96   rampur
1  gitesh     95  manipur

In [11]:
df.tail(3)

       name  marks     city
1    gitesh     95  manipur
2  santoshi     85   nagpur
3     soham     80     pune

In [12]:
df.describe()

           marks
count   4.000000
mean   89.000000
std     7.788881
min    80.000000
25%    83.750000
50%    90.000000
75%    95.250000
max    96.000000

In [13]:
silki = pd .read_csv("silki_csv.csv")

In [14]:
silki

   train no  speed     city
0      5623     56   rampur
1      5624     23  manipur
2      7894     48   nagpur
3      2315     63     pune

In [15]:
silki['speed']

0    56
1    23
2    48
3    63
Name: speed, dtype: int64

In [16]:
silki['speed'][1] = 92

C:\Users\LAPTOP\AppData\Local\Temp\ipykernel_3040\3681404903.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  silki['speed'][1] = 92

In [17]:
silki['speed']

0    56
1    92
2    48
3    63
Name: speed, dtype: int64

In [18]:
silki.to_csv('silki.csv')

In [19]:
silki.index = ['frist','second','thrid','fourth']

In [20]:
silki

        train no  speed     city
frist       5623     56   rampur
second      5624     92  manipur
thrid       7894     48   nagpur
fourth      2315     63     pune

In [21]:
ser = pd.Series (np.random.rand(34))

In [22]:
ser

0     0.539735
1     0.983619
2     0.260860
3     0.276491
4     0.975422
5     0.816693
6     0.721514
7     0.938672
8     0.997755
9     0.741662
10    0.429008
11    0.111453
12    0.730508
13    0.127006
14    0.854885
15    0.927850
16    0.037615
17    0.931534
18    0.647773
19    0.302587
20    0.732932
21    0.178006
22    0.773085
23    0.841137
24    0.865838
25    0.317967
26    0.069029
27    0.009162
28    0.228438
29    0.792626
30    0.061953
31    0.250249
32    0.246032
33    0.166471
dtype: float64

In [23]:
type(ser)

pandas.core.series.Series

In [24]:
newdf = pd.DataFrame(np.random.rand(344,5), index=np.arange(344))

In [25]:
newdf.head()

          0         1         2         3         4
0  0.073770  0.370774  0.467740  0.963354  0.008758
1  0.947634  0.820363  0.938114  0.727344  0.853100
2  0.025735  0.725155  0.492035  0.997617  0.791473
3  0.584622  0.404214  0.685092  0.446727  0.022844
4  0.749190  0.935617  0.165452  0.076236  0.921731

In [26]:
newdf

            0         1         2         3         4
0    0.073770  0.370774  0.467740  0.963354  0.008758
1    0.947634  0.820363  0.938114  0.727344  0.853100
2    0.025735  0.725155  0.492035  0.997617  0.791473
3    0.584622  0.404214  0.685092  0.446727  0.022844
4    0.749190  0.935617  0.165452  0.076236  0.921731
..        ...       ...       ...       ...       ...
339  0.895143  0.924656  0.268104  0.583816  0.191804
340  0.073497  0.102392  0.755515  0.194228  0.613383
341  0.383222  0.322497  0.953673  0.313950  0.915550
342  0.819553  0.643200  0.458616  0.683277  0.138697
343  0.277901  0.124661  0.846462  0.614401  0.552503

[344 rows x 5 columns]

In [27]:
type(newdf)

pandas.core.frame.DataFrame

In [28]:
newdf.describe()

                0           1           2           3           4
count  344.000000  344.000000  344.000000  344.000000  344.000000
mean     0.505072    0.525601    0.501054    0.490935    0.507114
std      0.292763    0.286676    0.281768    0.303091    0.286653
min      0.007290    0.002956    0.001881    0.004205    0.007058
25%      0.267825    0.277925    0.263246    0.226523    0.260670
50%      0.493428    0.504909    0.505614    0.469246    0.521021
75%      0.764385    0.769587    0.755536    0.762752    0.753098
max      0.992329    0.999403    0.991421    0.999688    0.998838

In [29]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [30]:
newdf.head()

          0         1         2         3         4
0  0.073770  0.370774  0.467740  0.963354  0.008758
1  0.947634  0.820363  0.938114  0.727344  0.853100
2  0.025735  0.725155  0.492035  0.997617  0.791473
3  0.584622  0.404214  0.685092  0.446727  0.022844
4  0.749190  0.935617  0.165452  0.076236  0.921731

In [31]:
newdf[0][0] = "'silki"

In [32]:
newdf.head()

          0         1         2         3         4
0    'silki  0.370774  0.467740  0.963354  0.008758
1  0.947634  0.820363  0.938114  0.727344  0.853100
2  0.025735  0.725155  0.492035  0.997617  0.791473
3  0.584622  0.404214  0.685092  0.446727  0.022844
4   0.74919  0.935617  0.165452  0.076236  0.921731

In [33]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       334, 335, 336, 337, 338, 339, 340, 341, 342, 343],
      dtype='int32', length=344)

In [34]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [35]:
newdf.to_numpy()

array([["'silki", 0.37077405010573494, 0.46773992668493347,
        0.9633540398663164, 0.008757520109780592],
       [0.9476341030984292, 0.8203633212281741, 0.9381137368335002,
        0.7273444079676971, 0.8531003801266431],
       [0.025734933432728924, 0.7251545543821493, 0.49203530306246257,
        0.9976166066770954, 0.7914732675088996],
       ...,
       [0.3832224565611566, 0.322497030367071, 0.9536728004538377,
        0.3139504770502176, 0.9155501830228927],
       [0.819552972113253, 0.6432001970546434, 0.45861589049690976,
        0.6832770901575064, 0.13869653634134405],
       [0.27790064214166343, 0.1246607510201968, 0.8464620370072748,
        0.614401404385288, 0.5525026551552312]], dtype=object)

In [36]:
newdf[0][0] = 0.1

In [37]:
newdf.head()

          0         1         2         3         4
0       0.1  0.370774  0.467740  0.963354  0.008758
1  0.947634  0.820363  0.938114  0.727344  0.853100
2  0.025735  0.725155  0.492035  0.997617  0.791473
3  0.584622  0.404214  0.685092  0.446727  0.022844
4   0.74919  0.935617  0.165452  0.076236  0.921731

In [38]:
newdf.to_numpy()

array([[0.1, 0.37077405010573494, 0.46773992668493347,
        0.9633540398663164, 0.008757520109780592],
       [0.9476341030984292, 0.8203633212281741, 0.9381137368335002,
        0.7273444079676971, 0.8531003801266431],
       [0.025734933432728924, 0.7251545543821493, 0.49203530306246257,
        0.9976166066770954, 0.7914732675088996],
       ...,
       [0.3832224565611566, 0.322497030367071, 0.9536728004538377,
        0.3139504770502176, 0.9155501830228927],
       [0.819552972113253, 0.6432001970546434, 0.45861589049690976,
        0.6832770901575064, 0.13869653634134405],
       [0.27790064214166343, 0.1246607510201968, 0.8464620370072748,
        0.614401404385288, 0.5525026551552312]], dtype=object)

In [39]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,334,335,336,337,338,339,340,341,342,343
0,0.1,0.947634,0.025735,0.584622,0.74919,0.767557,0.706001,0.65807,0.792403,0.939205,...,0.765874,0.626465,0.941549,0.469106,0.569839,0.895143,0.073497,0.383222,0.819553,0.277901
1,0.370774,0.820363,0.725155,0.404214,0.935617,0.100222,0.39358,0.25599,0.399177,0.535451,...,0.652546,0.131291,0.283889,0.492437,0.105692,0.924656,0.102392,0.322497,0.6432,0.124661
2,0.46774,0.938114,0.492035,0.685092,0.165452,0.170813,0.230163,0.346814,0.317347,0.784067,...,0.089467,0.468724,0.080415,0.758376,0.508384,0.268104,0.755515,0.953673,0.458616,0.846462
3,0.963354,0.727344,0.997617,0.446727,0.076236,0.826427,0.978091,0.571617,0.291713,0.029718,...,0.422541,0.852772,0.062441,0.882459,0.932367,0.583816,0.194228,0.31395,0.683277,0.614401
4,0.008758,0.8531,0.791473,0.022844,0.921731,0.445285,0.796985,0.91383,0.890425,0.1153,...,0.874852,0.735311,0.257418,0.639796,0.618659,0.191804,0.613383,0.91555,0.138697,0.552503

In [40]:
newdf.sort_index(axis=0,ascending=False)

            0         1         2         3         4
343  0.277901  0.124661  0.846462  0.614401  0.552503
342  0.819553  0.643200  0.458616  0.683277  0.138697
341  0.383222  0.322497  0.953673  0.313950  0.915550
340  0.073497  0.102392  0.755515  0.194228  0.613383
339  0.895143  0.924656  0.268104  0.583816  0.191804
..        ...       ...       ...       ...       ...
4     0.74919  0.935617  0.165452  0.076236  0.921731
3    0.584622  0.404214  0.685092  0.446727  0.022844
2    0.025735  0.725155  0.492035  0.997617  0.791473
1    0.947634  0.820363  0.938114  0.727344  0.853100
0         0.1  0.370774  0.467740  0.963354  0.008758

[344 rows x 5 columns]

In [41]:
newdf.sort_index(axis=1,ascending=False)

            4         3         2         1         0
0    0.008758  0.963354  0.467740  0.370774       0.1
1    0.853100  0.727344  0.938114  0.820363  0.947634
2    0.791473  0.997617  0.492035  0.725155  0.025735
3    0.022844  0.446727  0.685092  0.404214  0.584622
4    0.921731  0.076236  0.165452  0.935617   0.74919
..        ...       ...       ...       ...       ...
339  0.191804  0.583816  0.268104  0.924656  0.895143
340  0.613383  0.194228  0.755515  0.102392  0.073497
341  0.915550  0.313950  0.953673  0.322497  0.383222
342  0.138697  0.683277  0.458616  0.643200  0.819553
343  0.552503  0.614401  0.846462  0.124661  0.277901

[344 rows x 5 columns]

In [42]:
newdf[0]

0           0.1
1      0.947634
2      0.025735
3      0.584622
4       0.74919
         ...
339    0.895143
340    0.073497
341    0.383222
342    0.819553
343    0.277901
Name: 0, Length: 344, dtype: object

In [43]:
type(newdf[0])

pandas.core.series.Series

View and copy

View

In [44]:
newdf2 = newdf

In [45]:
newdf2[0][0] = 5623

In [46]:
newdf

            0         1         2         3         4
0        5623  0.370774  0.467740  0.963354  0.008758
1    0.947634  0.820363  0.938114  0.727344  0.853100
2    0.025735  0.725155  0.492035  0.997617  0.791473
3    0.584622  0.404214  0.685092  0.446727  0.022844
4     0.74919  0.935617  0.165452  0.076236  0.921731
..        ...       ...       ...       ...       ...
339  0.895143  0.924656  0.268104  0.583816  0.191804
340  0.073497  0.102392  0.755515  0.194228  0.613383
341  0.383222  0.322497  0.953673  0.313950  0.915550
342  0.819553  0.643200  0.458616  0.683277  0.138697
343  0.277901  0.124661  0.846462  0.614401  0.552503

[344 rows x 5 columns]

Copy

In [49]:
newdf2 = newdf.copy()

In [50]:
newdf2[0][1]= 123456

C:\Users\LAPTOP\AppData\Local\Temp\ipykernel_3040\748339294.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][1]= 123456

In [51]:
newdf2

            0         1         2         3         4
0        5623  0.370774  0.467740  0.963354  0.008758
1      123456  0.820363  0.938114  0.727344  0.853100
2    0.025735  0.725155  0.492035  0.997617  0.791473
3    0.584622  0.404214  0.685092  0.446727  0.022844
4     0.74919  0.935617  0.165452  0.076236  0.921731
..        ...       ...       ...       ...       ...
339  0.895143  0.924656  0.268104  0.583816  0.191804
340  0.073497  0.102392  0.755515  0.194228  0.613383
341  0.383222  0.322497  0.953673  0.313950  0.915550
342  0.819553  0.643200  0.458616  0.683277  0.138697
343  0.277901  0.124661  0.846462  0.614401  0.552503

[344 rows x 5 columns]

In [52]:
newdf

            0         1         2         3         4
0        5623  0.370774  0.467740  0.963354  0.008758
1    0.947634  0.820363  0.938114  0.727344  0.853100
2    0.025735  0.725155  0.492035  0.997617  0.791473
3    0.584622  0.404214  0.685092  0.446727  0.022844
4     0.74919  0.935617  0.165452  0.076236  0.921731
..        ...       ...       ...       ...       ...
339  0.895143  0.924656  0.268104  0.583816  0.191804
340  0.073497  0.102392  0.755515  0.194228  0.613383
341  0.383222  0.322497  0.953673  0.313950  0.915550
342  0.819553  0.643200  0.458616  0.683277  0.138697
343  0.277901  0.124661  0.846462  0.614401  0.552503

[344 rows x 5 columns]

Log Function

In [53]:
newdf.loc[0,0] = 654

In [54]:
newdf.head()

          0         1         2         3         4
0       654  0.370774  0.467740  0.963354  0.008758
1  0.947634  0.820363  0.938114  0.727344  0.853100
2  0.025735  0.725155  0.492035  0.997617  0.791473
3  0.584622  0.404214  0.685092  0.446727  0.022844
4   0.74919  0.935617  0.165452  0.076236  0.921731

In [62]:
newdf.columns = list("ABCDE")

In [63]:
newdf

            A         B         C         D         E
0         654  0.370774  0.467740  0.963354  0.008758
1    0.947634  0.820363  0.938114  0.727344  0.853100
2    0.025735  0.725155  0.492035  0.997617  0.791473
3    0.584622  0.404214  0.685092  0.446727  0.022844
4     0.74919  0.935617  0.165452  0.076236  0.921731
..        ...       ...       ...       ...       ...
339  0.895143  0.924656  0.268104  0.583816  0.191804
340  0.073497  0.102392  0.755515  0.194228  0.613383
341  0.383222  0.322497  0.953673  0.313950  0.915550
342  0.819553  0.643200  0.458616  0.683277  0.138697
343  0.277901  0.124661  0.846462  0.614401  0.552503

[344 rows x 5 columns]

In [65]:
newdf.loc[0,'A'] = 123456

In [66]:
newdf

            A         B         C         D         E
0      123456  0.370774  0.467740  0.963354  0.008758
1    0.947634  0.820363  0.938114  0.727344  0.853100
2    0.025735  0.725155  0.492035  0.997617  0.791473
3    0.584622  0.404214  0.685092  0.446727  0.022844
4     0.74919  0.935617  0.165452  0.076236  0.921731
..        ...       ...       ...       ...       ...
339  0.895143  0.924656  0.268104  0.583816  0.191804
340  0.073497  0.102392  0.755515  0.194228  0.613383
341  0.383222  0.322497  0.953673  0.313950  0.915550
342  0.819553  0.643200  0.458616  0.683277  0.138697
343  0.277901  0.124661  0.846462  0.614401  0.552503

[344 rows x 5 columns]

In [68]:
newdf.loc[[1,2],['C','D']]

          C         D
1  0.938114  0.727344
2  0.492035  0.997617

In [69]:
newdf.loc[[1,0],['A','D']]

          A         D
1  0.947634  0.727344
0    123456  0.963354

In [70]:
newdf.loc[[1,2],:]

          A         B         C         D         E
1  0.947634  0.820363  0.938114  0.727344  0.853100
2  0.025735  0.725155  0.492035  0.997617  0.791473

In [72]:
newdf.loc[:,['C','D']]

            C         D
0    0.467740  0.963354
1    0.938114  0.727344
2    0.492035  0.997617
3    0.685092  0.446727
4    0.165452  0.076236
..        ...       ...
339  0.268104  0.583816
340  0.755515  0.194228
341  0.953673  0.313950
342  0.458616  0.683277
343  0.846462  0.614401

[344 rows x 2 columns]